; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-1-1-1-8-2-8) (:domain depots)
(:objects
	depot0 - Depot
	distributor0 - Distributor
	truck0 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - Crate
	hoist0 hoist1 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 distributor0)
	(clear crate4)
	(at pallet2 distributor0)
	(clear crate3)
	(at pallet3 distributor0)
	(clear crate7)
	(at pallet4 distributor0)
	(clear crate5)
	(at pallet5 distributor0)
	(clear pallet5)
	(at pallet6 depot0)
	(clear crate6)
	(at pallet7 depot0)
	(clear pallet7)
	(at truck0 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at crate0 distributor0)
	(on crate0 pallet1)
	(at crate1 distributor0)
	(on crate1 crate0)
	(at crate2 distributor0)
	(on crate2 pallet3)
	(at crate3 distributor0)
	(on crate3 pallet2)
	(at crate4 distributor0)
	(on crate4 crate1)
	(at crate5 distributor0)
	(on crate5 pallet4)
	(at crate6 depot0)
	(on crate6 pallet6)
	(at crate7 distributor0)
	(on crate7 crate2)
)

(:goal (and
		(on crate0 pallet5)
		(on crate1 crate3)
		(on crate2 pallet2)
		(on crate3 pallet4)
		(on crate4 pallet3)
		(on crate5 crate0)
		(on crate6 pallet6)
		(on crate7 pallet1)
	)
))

; plan
1. (lift hoist1 crate5 pallet4 distributor0)
   deleted: (at crate5 distributor0) (available hoist1) (on crate5 pallet4) (clear crate5)
   added: (lifting hoist1 crate5) (clear pallet4)
   goals met: 1 of 8
2. (load hoist1 crate5 truck0 distributor0)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   goals met: 1 of 8
3. (lift hoist1 crate3 pallet2 distributor0)
   deleted: (at crate3 distributor0) (available hoist1) (on crate3 pallet2) (clear crate3)
   added: (lifting hoist1 crate3) (clear pallet2)
   goals met: 1 of 8
4. (drop hoist1 crate3 pallet4 distributor0)
   deleted: (lifting hoist1 crate3) (clear pallet4)
   added: (at crate3 distributor0) (available hoist1) (on crate3 pallet4) (clear crate3)
   goals met: 2 of 8
5. (lift hoist1 crate7 crate2 distributor0)
   deleted: (at crate7 distributor0) (available hoist1) (on crate7 crate2) (clear crate7)
   added: (lifting hoist1 crate7) (clear crate2)
   goals met: 2 of 8
6. (load hoist1 crate7 truck0 distributor0)
   deleted: (lifting hoist1 crate7)
   added: (in crate7 truck0) (available hoist1)
   goals met: 2 of 8
7. (lift hoist1 crate2 pallet3 distributor0)
   deleted: (at crate2 distributor0) (available hoist1) (on crate2 pallet3) (clear crate2)
   added: (lifting hoist1 crate2) (clear pallet3)
   goals met: 2 of 8
8. (drop hoist1 crate2 pallet2 distributor0)
   deleted: (lifting hoist1 crate2) (clear pallet2)
   added: (at crate2 distributor0) (available hoist1) (on crate2 pallet2) (clear crate2)
   goals met: 3 of 8
9. (lift hoist1 crate4 crate1 distributor0)
   deleted: (at crate4 distributor0) (available hoist1) (on crate4 crate1) (clear crate4)
   added: (lifting hoist1 crate4) (clear crate1)
   goals met: 3 of 8
10. (drop hoist1 crate4 pallet3 distributor0)
   deleted: (lifting hoist1 crate4) (clear pallet3)
   added: (at crate4 distributor0) (available hoist1) (on crate4 pallet3) (clear crate4)
   goals met: 4 of 8
11. (lift hoist1 crate1 crate0 distributor0)
   deleted: (at crate1 distributor0) (available hoist1) (on crate1 crate0) (clear crate1)
   added: (lifting hoist1 crate1) (clear crate0)
   goals met: 4 of 8
12. (drop hoist1 crate1 crate3 distributor0)
   deleted: (lifting hoist1 crate1) (clear crate3)
   added: (at crate1 distributor0) (available hoist1) (on crate1 crate3) (clear crate1)
   goals met: 5 of 8
13. (lift hoist1 crate0 pallet1 distributor0)
   deleted: (at crate0 distributor0) (available hoist1) (on crate0 pallet1) (clear crate0)
   added: (lifting hoist1 crate0) (clear pallet1)
   goals met: 5 of 8
14. (drop hoist1 crate0 pallet5 distributor0)
   deleted: (lifting hoist1 crate0) (clear pallet5)
   added: (at crate0 distributor0) (available hoist1) (on crate0 pallet5) (clear crate0)
   goals met: 6 of 8
15. (unload hoist1 crate7 truck0 distributor0)
   deleted: (available hoist1) (in crate7 truck0)
   added: (lifting hoist1 crate7)
   goals met: 6 of 8
16. (drop hoist1 crate7 pallet1 distributor0)
   deleted: (lifting hoist1 crate7) (clear pallet1)
   added: (at crate7 distributor0) (available hoist1) (on crate7 pallet1) (clear crate7)
   goals met: 7 of 8
17. (unload hoist1 crate5 truck0 distributor0)
   deleted: (available hoist1) (in crate5 truck0)
   added: (lifting hoist1 crate5)
   goals met: 7 of 8
18. (drop hoist1 crate5 crate0 distributor0)
   deleted: (lifting hoist1 crate5) (clear crate0)
   added: (at crate5 distributor0) (available hoist1) (on crate5 crate0) (clear crate5)
   goals met: 8 of 8
